results/20251229_171145_nginx_passthrough/runs/run_1.txt
Running 1m test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.86ms    2.10ms  42.69ms   84.94%
    Req/Sec     3.70k   418.07    12.36k    75.18%
  Latency Distribution
     50%    6.44ms
     75%    7.40ms
     90%    8.89ms
     99%   15.25ms
  883034 requests in 1.00m, 11.32GB read
Requests/sec:  14692.76
Transfer/sec:    192.84MB