results/20251229_171145_nginx_passthrough/runs/run_2.txt
Running 1m test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.88ms    2.00ms  49.72ms   83.81%
    Req/Sec     3.68k   358.96     4.38k    67.92%
  Latency Distribution
     50%    6.47ms
     75%    7.46ms
     90%    8.91ms
     99%   14.41ms
  878680 requests in 1.00m, 11.26GB read
Requests/sec:  14643.57
Transfer/sec:    192.19MB